using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

//Павлюков Михаил
//3. ** Исполнитель «Калькулятор» преобразует целое число, записанное на экране.У
// исполнителя две команды, каждой присвоен номер:
//1. Прибавь 1.
//2. Умножь на 2.
//Первая команда увеличивает число на экране на 1, вторая увеличивает его в 2 раза.Сколько
//существует программ, которые число 3 преобразуют в число 20:
//а.С использованием массива.
//b. * С использованием рекурсии.//Правильно ли я понимаю, что лучшего всего использовать рекурсивный обход дерева? Если, да, можем ли//мы разобрать данную задачу на уроке?

namespace Task_3
{
    class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
